{
    "B000C9VFEO": [
      {
        "summary": "WANT TO LOOSE YOUR PHONE?",
        "label": 0,
        "title": "Sony Ericsson Classic Case for Sony Ericsson C702a, C905a, K850i, TM506, W350a, W380a, W580i, W595a, W705a, W995a",
        "text": "VERY POOR CLIP, NO SPUR TO RETAIN CASE ON BELT. PLASTIC CLIP LOOSES CLAMPING ABILITY FAST. YOU WILL LOOSE YOUR PHONE! GET A CASE THAT HAS BELT LOOPS."
      }
    ],
    "B000M8WA2G": [
        {
          "summary": "Did not work for me",
          "label": 0,
          "title": "Bargaincell- Brand New Nokia 6103, 6102i, 6102, 6101, 2125i, 2126i, 2128i, 3220, 6015i, 6016i, 6019i, 3205, 3200, 6820, 6822, 3570, 3585, 3585i, 3586i, 3587i, 3588i, 3589i, 6200, 6225, 6585, 3100, 3120, 2270, 2285, 7210, 6800 CA-42 Compatible USB Data Cable",
          "text": "Seems pretty simple with CD included. Newer software is online from Nokia--but I could not get connection with Nokia 6820 and gave up. At least the cable was cheap enough. No idea if I failed or cable was incorrect."
        },
        {
          "summary": "I wish I had read the reviews before I bought this cable",
          "label": 0,
          "title": "Bargaincell- Brand New Nokia 6103, 6102i, 6102, 6101, 2125i, 2126i, 2128i, 3220, 6015i, 6016i, 6019i, 3205, 3200, 6820, 6822, 3570, 3585, 3585i, 3586i, 3587i, 3588i, 3589i, 6200, 6225, 6585, 3100, 3120, 2270, 2285, 7210, 6800 CA-42 Compatible USB Data Cable",
          "text": "The cable simply DOES NOT WORK. The PC does not detect the phone. I wrote to the seller telling them the cable DOES NOT WORK. They wrote back requesting the SKU number on the cable package. I emailed the SKU number to them. Then they wanted my cell phone model number. I emailed them the info. Then they sent me an email telling me \"the cable is fully compatible\" with my phone, and that I should make sure I have the latest software and drivers. I had already downloaded the latest Nokia PC Suite (which contains the drivers), so I emailed back telling them so. Then they wrote back telling me to make sure the PC was detecting the cable. I wrote back to them explaining that, yes, the PC does detect the USB cable, but not the phone. At that point they offered me a free replacement. I wrote back stating that I was willing to try a replacement cable, but I was not willing to pay for the shipping. They sent me a new cable. The replacement cable DOES NOT WORK. Basically, this company is selling a product that DOES NOT WORK. Considering the number of reviews here stating that the cable does not work, and considering that the company has very *probably* received numerous emails from other customers telling them that the cable DOES NOT WORK, I *suspect* the company knows they are selling a defective product, but I do not know that to be a fact. My advice to you is to not purchase this seller's cable. Save your money, even if it is only a few dollars. (Incidentally, if I had read the previous reviews prior to purchasing a cable, I would not have purchased this one. Unfortunately, I did not see the reviews because I purchased the cable from [...].)Update"
        }
    ],
    "B0000AKAI3": [
        {
          "summary": "Phone won't stay in charging stand",
          "label": 0,
          "title": "Nokia Premium Leather Case for Nokia Phones",
          "text": "Nice case, I bought it mostly so the phone won't fly apart when I drop it. The case covers the power button for the phone, but the power button still works fine through the case.I have a charging stand to hold my phone upright while it's charging. The case has a cutout for the charging socket, but because of the thickness of the leather, the phone doesn't connect with the charger. You can still use the travel charger, but to use the desktop charger I'd need to take the case off."
        }
    ],
    "B000GIUY98": [
        {
          "summary": "Great",
          "label": 0,
          "title": "Sony Ericsson z520a W550 W600i W600 W800 W800i W810 K700 K750 K750i K790 K790a K790c K800 K800c K800iK550i W880i Z610i Z750i DCU-60 USB Data Cable",
          "text": "Cheap price, not quality, I would buy again and recommend,of courseIf everything was like this easy to find, buy, cheap, great quality...shopper's heaven"
        }
    ],
    "B000HEE2QW": [
        {
          "summary": "It is what it is",
          "label": 0,
          "title": "Plantronics M63-X1 Mobile Headset for Most Phones with Standard 2.5mm Headset Jack - Audiovox, Blackberry, Kyocera, LG, Samsung, Sanyo, Tr?o - Ice",
          "text": "I used this a couple of times, it is a cheap headset. People complained they could hear me very well while I used it. For the price....it's to be expected."
        }
    ],
    "B000MUD47O": [
        {
          "summary": "Update",
          "label": 0,
          "title": "Samsung SPH-M500 Cell Phone Travel Charger / AC Adaptor / Battery Charger / Wall Charger",
          "text": "I got it from Accessory Export, LLC. The shipping was fast and rate was reasonable. I got one AC charger, one car charger, and two belt clips for less than $12.The AC charger works fine initially. It does cut off when the phone is fully charged as OEM charger does. But after two months of use, it broke. I could be just unlucky. I might try another one, but would not recommend it."
        }
    ],
    "B000E14G7S": [
        {
          "summary": "A bit iffy, but does make an improvement",
          "label": 0,
          "title": "Wireless Extenders YX500-Cel zBoost Cell Phone Signal Booster up to 2500 Square Feet of Coverage for Home or Office (800 MHz Phones)",
          "text": "I got this device because I have little to no service at the beach home. The problem I have with this device is that they say outside installation is best but DON'T tell you at the time of purchase that you should purchase an OPTIONAL outdoor kit. If it is recommeded that you put it outdoors, don't you think that they would include it or tell you at time of purchase that this kit is needed? The other problem is again associated with outdoor installation. They give you ab. 30 feet of coaxial cable which is great. The problem is that BOTH ends are finished with the crimped attachment hardware....try getting THAT through the existing cable hole to the outside. So, another trip to the hardware store 17 miles one way to get a crimping tool and masonry bits and screws to PROPERLY attach the mounting hardware for the signal atenna on the OUTSIDE brick. However, once the installation is done... several hours, miles and dollars later... I can get 3-4 bars when I used to only get 1-2 bars at best! I guess that beats having to stand at the end of the driveway in a thunderstorm to make calls to the office!"
        }
    ],
    "B0002WRGGW": [
        {
          "summary": "Very light, easy to use, \"stylish\"",
          "label": 0,
          "title": "Motorola HS820 Bluetooth Headset - Teal",
          "text": "I placed \"stylish\" in quotes because every time I use this headset I feel self-conscious. It looks a bit like a communication device from a 70's-era sci-fi film. This is made all the worse by a flashing blue LED on the exterior of the unit. But if you can get past that...Man, what a cool toy. It's extremely light, so it just hangs over your ear unintrusively. I initially thought that it was a bit gratuitous to spend so much for a wireless headset when I could get a traditional one for so cheap. But the sound quality is far better than any \"wired\" headset I've used in the past, and the listeners on the other end seem to have a much easier time understanding me. The freedom from wires is especially welcome. Setup was painless, but I do have a Motorola phone, so perhaps my experience isn't representative of what users of other bluetooth phones might witness.My only other complaint is that you have to carry an additional charger when traveling if you want to charge your phone and headset at the same time. Since the headset uses the same charger as my phone, I could presumably do with just one charger, but I'd have to remember to change out devices (the headset charges in about 2 hours). Since I always charge while I'm sleeping, this would never happen, so two chargers it is.In summary, the pros easily outweigh the cons for this device, so I give it five stars."
        },{
            "summary": "Stops working after a while",
            "label": 0,
            "title": "Motorola HS820 Bluetooth Headset - Teal",
            "text": "I used this headeset for two months and all was well, but then it suddenly stopped working, even though the charging process was OK. When I googled this issue, it turned out this was a common problem with this headset. Highly unrecommended - better save your money for a bit more expensive piece that does work."
          },
          {
            "summary": "Bluetooth Motorola HS820",
            "label": 0,
            "title": "Motorola HS820 Bluetooth Headset - Teal",
            "text": "THis bluetooth works very well, I used to have one years ago and the battery died but could not find a way to replace battery. Tried a newer Motorola H700 and other brands too but found most people complained that I sounded muffled on other end.HS820 works very well on hearing and sending, not as convient shutting off or turning on as a flip bluetooth but it has very good range > 30' and does not distort when you walk away from it. Highly recommend"
          },
          {
            "summary": "complicated",
            "label": 0,
            "title": "Motorola HS820 Bluetooth Headset - Teal",
            "text": "need one on one help. fits weird on ear so i don't use it and use a headset instead."
          }
    ],
    "B0006H4FCQ": [
        {
          "summary": "Good sound, great features - using Ipaq h6315",
          "label": 0,
          "title": "Nokia HDW-3 Bluetooth Wireless Headset",
          "text": "I purchased this headset specifically because of the independant on/off button. Most headsets, when on, prevent the handset from ringing. When off, they take upwards of three to five seconds to turn on. Since I do not wear my headset all of the time this is a problem for me as I want to hear my handset ring and be able to turn on the headset to answer the call.Interestingly, the HDW-3 circumvents this problem entirely by allowing the handset and the headset to ring at the same time. If I am wearing my headset not only do I hear the ring tone in my ear, but also from the phone. If the headset is off it is only a matter of pressing the on/off button for a second to activate the headset and take the call wirelessly. Very convenient.The sound quality is very good, and the headset supports phone audio, standard audio, and voice dialing.Bluetooth connectivity is a snap. Whenever the headset is turned on it is discoverable for ten minutes. No fiddling with headset buttons to make the connection is necessary. The headset can connect to a maximum of eight devices, one at a time. The first device it pairs with is the default device, and it will always try to connect to this device first when turned on. If it cannot connect to the default device it will attempt to connect to the last connected device other than the default.One thing that really threw me was the absence of an AC adapter with the headset. Since the headset is by Nokia they apparently expect the customer to already own a Nokia phone. The headset works with several different Nokia AC adapters, which is nice, but if you don't already have one of these then you're faced with purchasing a seperate item just to use this device. Very poor decision on Nokia's part, especially with a $100 original retail price.The ear loops are just rubber bits that sort of snap onto the headset. They're somewhat stiff and very uncomfortable if worn incorrectly. Getting the right fit can be difficult. There are two different sized loops included, but this doesn't really account for much variation in people's ear shapes and sizes. I've found that wearing the larger loop upside down provides the most comfortable fit. It's comfortable enough for short term wear which is what I wanted it for anyway.The very odd little membranous buttons on top of the unit are for the volume. They're a bit hard to press since they're so tiny, and it's hard to tell if you're actually pressing them when wearing the device.Overall, I like this unit. It sounds good, works with the h6315 the way I want it to, and is lightweight. Nokia dropped the ball on wearability and failed to include an AC adapter. If you're looking for a headset to wear as necessary, and you've already got a Nokia adapter laying around then this is a great sounding, easy to use device.Pros:Easy connectivityLightweight and sharp lookingSounds greatPhone and headset ring at the same time.Independant on/off switchCons:No AC adapter includedUncomfortable ear pieceBizarre volume buttons"
        },
        {
          "summary": "Size *DOES* matter!",
          "label": 0,
          "title": "Nokia HDW-3 Bluetooth Wireless Headset",
          "text": "I've owned this for about 3wks now and this is what I like about it:-VERY small and light weight!-mic is very sensitive and clear-earpiece sound quality is almost the same as hearing it from the headset-battery life is very close to what's advertised-it looks really cool!What I don't like about it:-volume buttons are too small and hard to get atI used to own the Jabra BT headset and I'm glad I switched. The Nokia has a dedicated on/off switch versus the Jabra's \"press and hold this button for 5sec to turn on or off\" switch. Belive me, it saves a wealth of convenience."
        }
    ]
    ,"B000GYY6EG": [
        {
          "summary": "Great deal on Phone Batteries",
          "label": 0,
          "title": "Lenmar Cell Phone Battery for Samsung SCP-8200, and Sanyo SCP-8200 Series",
          "text": "Ordered at a great price, received in satisfactory time and in very nice condition. The batteries were good quality. I would recommend this to anyone. Jimmie"
        }
    ],
    "B000TGAEXI": [
      {
        "summary": "Still Trying",
        "label": 0,
        "title": "Sound ID SM100 Ear Module Bluetooth Headset",
        "text": "This is the second little bluetooth headset I have had. I thought I'd wait a couple of years and try again.Some of the problems I am having with this device may have to do with my sprint service and/or the cell phone; that is, I have had interference noise and also people have reported that I sound like I'm in a tunnel. Also, I have occasionally heard buzzing through the set. This is not all of the time.I am happy with the ease of use and also with the comfort. It is light and can stay in my ear a long time before it gets annoying. The device holds a charge for a long time."
      },
      {
        "summary": "Sound ID SM100 Bluetooth Headset",
        "label": 0,
        "title": "Sound ID SM100 Ear Module Bluetooth Headset",
        "text": "The Sound ID SM100 Bluetooth Headset is in the family of smaller bluetooth headsets. Having owned multiple other headsets that suffer from lack of clarity, this unit is fantastic. In the past people have complained when I was in handsfree mode... now with this headset it is not a problem. It offers multiple environment modes, easy volume controls and fits in your ear without an additional clip. Buy it... you will be glad you did.RWB/ Indiana"
      },
      {
        "summary": "Mr. (Director of HR)",
        "label": 0,
        "title": "Sound ID SM100 Ear Module Bluetooth Headset",
        "text": "I believe the Sound ID 100 is an excellent headset. I have 5 headsets (Nokia, 2 Motorolas, Jawbone,and ID 100 so far.I will buy the Sound ID HD300 when it comes out on the market. Next month, Powermate Max 4X by Motor Trend.I will use the one which is least intrusive, and easy to turn off and on, as well as adjust volume. So far Sound ID is the best. Good clear sound is a given these days.My only advice is to include several backup over-the-ear loops in the package."
      },
      {
        "summary": "The best headset I have tried.",
        "label": 0,
        "title": "Sound ID SM100 Ear Module Bluetooth Headset",
        "text": "I had a difficult time finding a bluetooth headset that I really liked. I have spent a lot of time, and money, trying several styles. This is how I would rank the ones I own:#1. Sound ID SM100 Ear Module Bluetooth Headset. Best ear fit, sound is sharp, clear & crisp. When not on the phone the headset changes to a listening mode and hearing through it is very easy. Overall my favorite.#2. Plantronics Discovery(tm) 665 Bluetooth Headset. This one also has very good sound but a bit muffled, not quite as crisp as the Sound ID but still very good. If you prefer a softer sound, not as sharp, this one would be best. It is also the lightest weight and fit was quite good.#3. Aliph Jawbone Bluetooth Headset. I just couldn't take to this headset. I found it a bit awkward, the fit in my ear was just OK. The sound was tinny, kind of like listening through a tin can. I could hear but it was harsh sounding. This one did have the loudest volume.I found myself mostly using the Sound ID, occasionally the Plantronics, and never the Aliph Jawbone.VERY IMPORTANT"
      },
      {
        "summary": "Comfortable, clear, stylish earpiece",
        "label": 0,
        "title": "Sound ID SM100 Ear Module Bluetooth Headset",
        "text": "Bottom Line = Everything is excellent except noise cancellation, but it's good.Pros:The size. It is very small and very light but not cheap. It fits very nice in your ear with a very small rubber ring that sits in the upper part of the crease in the middle of your ear. The small ring does not fit over your ear, so you can wear sunglasses or glasses and not have it interfere with that which is a major plus.The comfort. I wore it for 8 hours and felt no discomfort. After a while you don't even notice you're wearing it except for a slight decrease in hearing in that ear.The clarity. I could hear every caller with good detail and no hissing or any other kind of noise. The caller couldn't always hear me well but I'll explain that later.The Style. You don't look like you have some device implanted on your ear. No shiny BLING. Nice sleek, hidden earpiece that does not draw attention to it.The technology. You can charge it off your USB port and it comes with the adapter to do so. It does come with an over the ear hook if you choose. It has a feature that allows you to amplify what your ambient noise is around you. At first I thought who would ever use this. Then I went shopping with my wife and I couldn't hear her well out of my left ear because the earpiece sits in your ear and does block external sound from coming in. Not a lot but enough to be an annoyance if having a conversation in a busy store. I turned on the ambient amplification and problem solved. It's a very easy button to locate and turn off when you don't need it.ConsThe noise cancellation is just ok. If you like talking with a convertible or windows down at highway speed, get a jawbone. Talking in noisy loud streets with lots of traffic noise is also loud for the person on the other end.Driving with windows up, radio slightly on, AC or heat cranking, scrambling around in airports, no problem. The bottom line is if the ambient noise level makes you talk louder in order for another person to hear, then it's not going to filter it all out. For me it's not an issue.The last con is a slight reduction in hearing in the ear you have it in, unless you turn on ambient amplification which does burn battery power faster. I had ambient on for almost 2 hours and talked for 1 and the battery never went dead. I don't know the extent of battery life but it lasts me all day."
      }
    ]
}