{
    "B0002VIXOC": [
        {
          "summary": "Don't get this phone if you use voice dialing!",
          "label": 1,
          "title": "Motorola V220 Phone (AT&T)",
          "text": "I don't like this phone. It's too small to use, even with the programmable buttons I can't get it to work the way I want. And the voice dialing feature is terrible. Either it won't save the name when you try to set it up or it can't find it when you try and use it. Also very slow to actually dial the number when it does work. I've returned the phone to Cingular thinking it was just a faulty phone, the next one worked for a few days and then started screwing up too. Can't return any more to Cingular, so went to Motorola. Their solution was to reset the phone, which removed all the programming, but did make the voice dialing work for 5 minutes. The I found you just had to turn the phone on and off to get it to work, but that's not really a solution now, is it?And it's not just my phone that does this, my kid's phone, my husband's phone and at least one other teen we know with this phone have the same problem!!!Phone also comes with practically no ringtones, no games,On the plus side, the camera and speakerphone are good. I was impressed with how good the pictures turn out after you send them to a PC."
        }
    ],
    "B000KFWUMG": [
        {
          "summary": "Frigid Awesome!",
          "label": 1,
          "title": "Cingular 8525 PDA Phone",
          "text": "I so loved this device, and then to get it at an outandingly great price was even better! The only drawback was that it was apparently on backorder when I purchased it, so the expected delivery date was over a month away. I complained a little along with others and the date was shifted to just over 1 week or so. Overall great procuct!"
        }
    ],
    "B000HCQKTG": [
        {
        "summary": "Everything I expected",
        "label": 1,
        "title": "Sony Ericsson K790a Phone (Unlocked)",
        "text": "Takes great photos, excellent color, great call quality, good battery life (unless there is a lot of picture editing), intuitive to use"
      }
    ],
    "B0001T3O58": [
        {
          "summary": "Great Phone",
          "label": 1,
          "title": "Motorola V400 Phone (AT&T)",
          "text": "I have had this phone for about 5 months now and i have never had any problem with it. I great reception all the time. I also have wireless internet, text, multimedia, and instant messaging. Not to metion the great games i get and the great sounding ringers from cingular."
        }
    ],
    "B000QU5GLM": [
        {
          "summary": "Samsung SCH i730",
          "label": 1,
          "title": "Samsung SCH i730 Verizon Wifi+PDA+Cell Phone",
          "text": "This Samsung comes with 2 batteries and a desktop charger that will charge both batteries and sync you to your PC all at the same time. It has features dripping off it. The PDA looks and acts exactly like an HP Ipaq. It is however a bit bulky and the buttons on both sides tend to get bumped very easy setting off a barage of functions. Functions like the lady saying \"Please Say a Command\". All in all the phone is feature-rich. It has a full qwerty keyboard that slides down. The voice commands work well when setup properly. If your address book has all the phone numbers filled in, it will ask you when you say a person name if you want to dial their home, cell or work number. A good phone and PDA that is a little bulky in todays market. Made by Samsung is a real plus."
        }
    ],
    "B0000AYKXG": [
    {
        "summary": "...Awesome Phone, Stunning and Endless Vision Services",
        "label": 1,
        "title": "PCS Phone Sanyo SCP-8100 (Sprint)",
        "text": "I have used pretty much all Samsung phones while being on the Sprint PCS service. When I switched to the Sanyo 8100, I was amazed by the quality of it. The outside feels very smooth, not rough like the Nokia-Series phones. Secondly, almost every single aspect of this phone is customizable, right down to the phones 'Power On\\Off Sound' The cameras reaction time can be a bit slower than some of the other phones in its class, and you have to hold the camera still about 3 seconds before you snap the picture, but other than that, the pictures look great! You can easisly upload them to your own personal Sprint PCS Website, e-mail them, or instantly send them to other PCS Vision users.Then theres PCS Vision, which in one word is, Awesome. I signed on, and almost flipped when I was watching movie trailers on the thing, with full-sound comming out the rear-speaker, and decent, full color video appering on the screen. They even have news, sports, entertainment and other movie-clips you can view on the phone. And, for an extra 9.99 a month you can get a service called MobiTV, you can get TLC, Discovery, MSNBC, CNBC, ABC News Live, College Sports TV, CMC, IMN, cNet TV, the list doesnt end. Try getting that on Verizon! Check it out at www.MobiTV.com.Sprint PCS Service can be shakey in some areas, but I tend to get good to great call quality wherever I go (Most people cant tell im calling them from a cell phone) The phone is a little bulky in the pocket, but nothing crazy. I'd have to say, this is qutie the phone. Hope this helps!"
      },
      {
        "summary": "Finally a Phone I haven't had a problem with!",
        "label": 1,
        "title": "PCS Phone Sanyo SCP-8100 (Sprint)",
        "text": "I went through about 5 phones within a 4 month period always some kind of problem. Until I upgraded to the Sanyo 8100 which Im shocked to have now had it for longer than a year. I could have sworn it would just had lasted me about 6 months. So I rate this Sprint phone with 5 stars and I plan on staying with it till it dies or just stay in the Sanyo family."
      },
      {
        "summary": "great phone!",
        "label": 1,
        "title": "PCS Phone Sanyo SCP-8100 (Sprint)",
        "text": "i love this phone. a few years ago i knew a guy who had a phone with internet service. it was a big and bulky thing, like a shoebox, almost. the internet connection sometimes took 5 minutes. i thought it was so cool.i didn't know what cool was. the bright color screen of this phone is very vibrant and contains good-sized text. all kinds of different ring tones can be downloaded. from tones to actual songs, it's an awesome feature, but you cannot prelisten to the tones before you download them. that is a real letdown. i downloaded \"diff'rent strokes\" blindly and was very accepting of it's replicated melody. but when i downloaded \"goodtimes\" it sounded like a mixture of \"cheers\" and \"taxi.\"photo quality is a notch less than average. about what you could expect from a celphone in this day and time, with no zoom. the feature of choosing different frames for your photos is cute and it's even better that you can email them to any address you have loaded.this is a phone review, so i won't talk about the sprint service as it is immaterial. let's just say that it could be better, but i won't count that against the phone.it's got a huge phone address databank and you can apply photos and rings to certain numbers. when my fiance' calls, her picture lights up on the screen with her \"american pie\" ringtone blaring. supercool.included is a calculator, calender with daily schedule alerts, a strong gaming system and lots of different applications that you can download, such as mapquest or the weather channel. if you're lost, the ability to pull up mapquest on your freakin' celphone is a godsend. the phone is compact and comes with pc connection inlets.with all these features, it manages to actually allow you to dial phone numbers and talk to people who also own phones. that helps too.AMENDMENT NOV. 18 2005.THIS PHONE'S BATTERY LIFE SUCKS! AND THE SCREEN GOES BAD AFTER A WHILE TOO."
      }
    ],
    "B000IIFRUW": [
        {
          "summary": "Phone doesn't matter if carrier's service is atrocious",
          "label": 1,
          "title": "palm Treo 700wx Phone (Sprint)",
          "text": "It doesn't matter how many bells and whistles come on a particular phone - it's only as good as the carrier. With Sprint, you will be headed for disappointment and frustration. Customer service, when you can actually get through to them, is incompetent. Prepare to have hours of your time stolen from you when you deal with a billing problem with Sprint. After switching credit cards, I've spent days trying to give them the new number to bill to, with no luck. I've had charges for services I never ordered nor authorized appear on my bill, and then spent literally hours of time e-mailing, trying to access their website and calling, with no resolution. Find a phone and a plan you can like with another carrier."
        },
        {
          "summary": "Great network, poor PDA for the price.",
          "label": 1,
          "title": "palm Treo 700wx Phone (Sprint)",
          "text": "The Palm OS version is much better, but I did somewhat like using this version as well. I'm giving this phone 4 stars because of the network it is running on, but the phone itself is not the best. Palm ALWAYS comes out with a phone with limited memory, then comes out with a minor update later with a little bit more RAM. There is far cheaper phones with more memory out there, which is sad, seeing as Treo's are very high priced. Palm came out with the Treo 600, then came out with the Treo 650 with a better screen and a but more memory. Now there is talk of a Treo 750, with the same type of upgrades. This has caused me to totally give up on Treo's. For Palm to milk us customer over and over again, with small upgrades, shows no respect. Palm also outsources their customer care, so good luck in getting help. The ONLY perk is Sprint only charges $15 dollars a month for PDA access. Which is far less then the $30, $40, and $50 that T-Mobile, Verizon and Cingular charge for the same type of access.If you want a PDA, go with the Q or PPC. Unless you like wasting your money on a phone, just so the company can come out with a phone with a few upgrades later on. I respect Palm because they are an American company, but I will never buy anything from them again. Which is a complete 180 from my stance just a few years ago."
        },
        {
          "summary": "Great phone, some problems with Sprint",
          "label": 1,
          "title": "palm Treo 700wx Phone (Sprint)",
          "text": "While I love the phone, there are some issues with this phone that Sprint (or Palm) has not worked out yet. The biggest issue is that you cannot send text messages to people who are on Verizon or on t-Mobile. For some reason text messages are never received by people on those networks. Sprint is aware of this problem, but have no resolution in the near future. You are able to receive text messages from them however."
        },
        {
          "summary": "Amazing - Better than I ever anticpated",
          "label": 1,
          "title": "palm Treo 700wx Phone (Sprint)",
          "text": "I already had a Sprint PDA, but when I saw this one, decided to upgrade. I saw that it could be used with my SlingBox to play cable TV, PVR, and DVD player on the PDA screen. Sure enough - works perfectly. Easy to set up. Just amazing. Now I can watch TV from my own cablebox whenever I am. Very fast transfer rate.I also found the keyboard to be quite easy to use. I've had it for a few weeks, and I'm still learning its features, but it has everything I could have asked for. Syncs with my VPN, Bluetooth compatible, and a wonderfully sharp screen.My husband liked mine so much, we are buying another one for him."
        }
    ],
    "B0002Z8CSA": [
        {
          "summary": "Good phone for day to day use",
          "label": 1,
          "title": "Motorola V400 Unlocked Cell Phone--U.S. Version with Warranty (Silver)",
          "text": "I've been using a Motorola V190 for well over 2 years and figured I need a similar phone as replacement. I wasn't disappointed - keypad and controls were similar, audio was great in a thinner package. While battery capacity was limited it made for a slimmer phone I could tuck in a belt holster without it getting caught in doors and narrow passageways. I don't use the camera much."
        },
        {
          "summary": "sturdiest phone ever!",
          "label": 1,
          "title": "Motorola V400 Unlocked Cell Phone--U.S. Version with Warranty (Silver)",
          "text": "I didn't buy from this seller, but I owned this phone when it first came out. It is by far one of the best cell phones I've ever owned. It has great reception, the sound quality is superb, and is very very sturdy. My phone was dropped down the stairs, dropped in a puddle, left out in the sun at the beach where little grains of sand got everywhere and it functioned just fine. The material it's made of is really tough and doesn't scratch easily if you take care not to drop it often. The only problem I found with this phone is that it has a really poor camera and tiny screen. Everything else was above par. Hope this helps! :)"
        },
        {
          "summary": "motorola from freehasslecell.com",
          "label": 1,
          "title": "Motorola V400 Unlocked Cell Phone--U.S. Version with Warranty (Silver)",
          "text": "order took 2 weeks because the package came back to them from the post office damaged. at least they upgraded it to a slightly better phone for it, but it still shouldnt have happened in the first place"
        }
    ],
      "B000CBG95W": [
        {
          "summary": "Know what you're getting ...",
          "label": 1,
          "title": "Motorola T730c Verizon",
          "text": "This phone DEFINITELY has its pluses and minuses. It never drops calls and it's very reliable. HOWEVER, the volume is almost never loud enough. The vibrate is very weak compared to other Motorola phones that I've owned. I checked with Verizon and even tested other copies of the same phone and it's just plain bad. I picked it based on a phone tech's recommendation from Verizon. I won't ever make that mistake again.I didn't really notice the volume issue until I attached a headset and had a very hard time hearing the caller on the other end. I tried every headset under the sun, even ones with additional volume boosting by battery, and it didn't help much. If you are in a quiet room, it's fine. If you want to have a conversation outside, in your car, or even in a semi-crowded room ... don't hold your breath.Is it reliable and easy to use? Definitely! But don't say that I didn't warn ya."
        }
    ],
      "B000BYDG6A": [
        {
          "summary": "Excellent basic phone. Good reception, easy to use. Loud and clear sound",
          "label": 1,
          "title": "Silver Sprint PCS Vision Phone w/ Ready Link",
          "text": "If you are looking for a phone that does not have a camera, and is easy to use and gets good reception, this is it. Sanyo makes the best phones in the Sprint line as far as reception is concerned. Much better than Samsungs. The sound is very loud and clear. I also dropped this phone in my cats water bowl, but after drying it on my dashboard in the sun for a day, it still works fine 3 months later.This phone works almost anywhere any other phone will work, even in the elevator where I work. The battery consumption is low. The interface is easy to use, as is the memo-recording feature. It is small, compact, and the key guard allows you to carry it in your pocket without activating any buttons whatsoever. It will occasionally make a beep when you hit a button if you don't \"silence all\". To sum up:The main advantages are:1. good reception2. very loud and clear sound3. low battery consumption4. easy user interface5. speaker phone works well eough to useThe main drawbacks are:1. Screen is suitable only for text messaging and general offline functions.2. The side buttons are really easy to hit when you're trying to handle the phone and it starts the memo thing recording.3. The LCD sub panel on the outside of the phone is too small and the number scrolls so slowly that if a number that is not in your phone book calls you, half of it is scrolled off by the time you can get the phone out of your pocket.That's about it."
        },
        {
          "summary": "Best Cell Phone that I Have ever owned!",
          "label": 1,
          "title": "Silver Sprint PCS Vision Phone w/ Ready Link",
          "text": "This is the best cellphone I have ever owned. The Speakerphone works great. I love being able to dial without opening the phone. The ability to turn on or off the guard for the side keys is fine.I guess the only gripe I have is that the radio service is incompatible with Nextel and now that the two have merged one would expect it to improve. Since my buddy with Nextel radio (but not phone) for work just bought a cellphone that pretty much erases that gripe.Also, the fact that it is not compatible with the Sprint travel navigator options is a bit of a drawback.However, it works well, has a long battery life.. it is easy to use, and even the headsets from the ninety-nine cent store work with it. It is a great phone and I recently purchased one for my wife. I'm very happy with Sprint and their service."
        },
        {
          "summary": "For the price, this is a great phone.",
          "label": 1,
          "title": "Silver Sprint PCS Vision Phone w/ Ready Link",
          "text": "I got this phone 3 weeks ago in the pink color.I have to say, that going from Samsung to Sanyo I was a bit apprehensive. But I love this VI-2300. I somewhat miss having a camera function, but really how much do you use a camera on a phone? I have an actual digital camera for that. As for this phone, I like that the ringer is very loud, and it's quite easy to program and use. The speaker works very nice on it also. I leave it on power save otherwise the battery does wear down a lot faster. If it is on power save, I can go for days without having to charge.I would recommend this phone to anyone who wants a nice looking phone without paying an arm and a leg and that doesn't have a camera on it."
        },
        {
          "summary": "Good Basic Phone",
          "label": 1,
          "title": "Silver Sprint PCS Vision Phone w/ Ready Link",
          "text": "I was looking for an electronic manual and came across this page. After glancing over the reviews I had to respond. This phone is basic and was sold as a basic phone. It is even FREE too so that indicates BASIC.The battery life is decent even with speaker on. I talk on it (and my other two) for over 2 hours a day with speaker because I am in traffic and hate headsets. I talked to the wife once on a 2 hour commute through the countryside and into the city without the call dropping. I live in a rural area far from a cell tower. I need external antennas with my other phones, but not this one.So if you are looking for a BASIC phone, this is it. If not, then this isn't it!"
        }
    ]
        
}